Thanh045/mliot-embeddedc-2026-hw/week04/Core/Inc/stm32f1xx_hal_conf.h
#ifndef STM32F1XX_HAL_CONF_H
#define STM32F1XX_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

#define HSE_VALUE               8000000U
#define HSE_STARTUP_TIMEOUT      100U
#define HSI_VALUE               8000000U
#define LSI_VALUE                 40000U
#define LSE_VALUE                 32768U
#define LSE_STARTUP_TIMEOUT        5000U
#define VDD_VALUE                  3300U
#define TICK_INT_PRIORITY              0U
#define USE_RTOS                       0U
#define PREFETCH_ENABLE                1U

#define assert_param(expr) ((void)0U)

#include "stm32f1xx_hal_rcc.h"
#include "stm32f1xx_hal_flash.h"
#include "stm32f1xx_hal_gpio.h"
#include "stm32f1xx_hal_cortex.h"

#ifdef __cplusplus
}
#endif

#endif
